Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/cru.h
#define CRU_REFO5CONCLR_Msk                   _UINT32_(0x00000000)                                 /* (CRU_REFO5CONCLR) Register Mask  */


/* -------- CRU_REFO5CONSET : (CRU Offset: 0x128) (R/W 32)  -------- */
#define CRU_REFO5CONSET_RESETVALUE            _UINT32_(0x00)                                       /*  (CRU_REFO5CONSET)   Reset Value */

#define CRU_REFO5CONSET_Msk                   _UINT32_(0x00000000)                                 /* (CRU_REFO5CONSET) Register Mask  */


/* -------- CRU_REFO5CONINV : (CRU Offset: 0x12C) (R/W 32)  -------- */
#define CRU_REFO5CONINV_RESETVALUE            _UINT32_(0x00)                                       /*  (CRU_REFO5CONINV)   Reset Value */

#define CRU_REFO5CONINV_Msk                   _UINT32_(0x00000000)                                 /* (CRU_REFO5CONINV) Register Mask  */


/* -------- CRU_REFO5TRIM : (CRU Offset: 0x130) (R/W 32) REFERENCE OSCILLATOR 5 TRIM REGISTER -------- */
#define CRU_REFO5TRIM_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_REFO5TRIM) REFERENCE OSCILLATOR 5 TRIM REGISTER  Reset Value */

#define CRU_REFO5TRIM_ROTRIM_Pos              _UINT32_(23)                                         /* (CRU_REFO5TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Position */
#define CRU_REFO5TRIM_ROTRIM_Msk              (_UINT32_(0x1FF) << CRU_REFO5TRIM_ROTRIM_Pos)        /* (CRU_REFO5TRIM) Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock Mask */
#define CRU_REFO5TRIM_ROTRIM(value)           (CRU_REFO5TRIM_ROTRIM_Msk & (_UINT32_(value) << CRU_REFO5TRIM_ROTRIM_Pos)) /* Assigment of value for ROTRIM in the CRU_REFO5TRIM register */
#define   CRU_REFO5TRIM_ROTRIM_ZERO_Val       _UINT32_(0x0)                                        /* (CRU_REFO5TRIM) 0/512 (0.0) divisor added to RODIV value  */
#define   CRU_REFO5TRIM_ROTRIM_1_Val          _UINT32_(0x1)                                        /* (CRU_REFO5TRIM) 1/512 (0.001953125) divisor added to RODIV value  */
#define   CRU_REFO5TRIM_ROTRIM_2_Val          _UINT32_(0x2)                                        /* (CRU_REFO5TRIM) 2/512 (0.00390625) divisor added to RODIV value  */
#define   CRU_REFO5TRIM_ROTRIM_256_Val        _UINT32_(0x100)                                      /* (CRU_REFO5TRIM) 256/512 (0.5000) divisor added to RODIV value  */
#define   CRU_REFO5TRIM_ROTRIM_511_Val        _UINT32_(0x1FF)                                      /* (CRU_REFO5TRIM) 511/512 (0.998046875) divisor added to RODIV value  */
#define CRU_REFO5TRIM_ROTRIM_ZERO             (CRU_REFO5TRIM_ROTRIM_ZERO_Val << CRU_REFO5TRIM_ROTRIM_Pos) /* (CRU_REFO5TRIM) 0/512 (0.0) divisor added to RODIV value Position  */
#define CRU_REFO5TRIM_ROTRIM_1                (CRU_REFO5TRIM_ROTRIM_1_Val << CRU_REFO5TRIM_ROTRIM_Pos) /* (CRU_REFO5TRIM) 1/512 (0.001953125) divisor added to RODIV value Position  */
#define CRU_REFO5TRIM_ROTRIM_2                (CRU_REFO5TRIM_ROTRIM_2_Val << CRU_REFO5TRIM_ROTRIM_Pos) /* (CRU_REFO5TRIM) 2/512 (0.00390625) divisor added to RODIV value Position  */
#define CRU_REFO5TRIM_ROTRIM_256              (CRU_REFO5TRIM_ROTRIM_256_Val << CRU_REFO5TRIM_ROTRIM_Pos) /* (CRU_REFO5TRIM) 256/512 (0.5000) divisor added to RODIV value Position  */
#define CRU_REFO5TRIM_ROTRIM_511              (CRU_REFO5TRIM_ROTRIM_511_Val << CRU_REFO5TRIM_ROTRIM_Pos) /* (CRU_REFO5TRIM) 511/512 (0.998046875) divisor added to RODIV value Position  */
#define CRU_REFO5TRIM_Msk                     _UINT32_(0xFF800000)                                 /* (CRU_REFO5TRIM) Register Mask  */


/* -------- CRU_REFO5TRIMCLR : (CRU Offset: 0x134) (R/W 32)  -------- */
#define CRU_REFO5TRIMCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (CRU_REFO5TRIMCLR)   Reset Value */

#define CRU_REFO5TRIMCLR_Msk                  _UINT32_(0x00000000)                                 /* (CRU_REFO5TRIMCLR) Register Mask  */


/* -------- CRU_REFO5TRIMSET : (CRU Offset: 0x138) (R/W 32)  -------- */
#define CRU_REFO5TRIMSET_RESETVALUE           _UINT32_(0x00)                                       /*  (CRU_REFO5TRIMSET)   Reset Value */

#define CRU_REFO5TRIMSET_Msk                  _UINT32_(0x00000000)                                 /* (CRU_REFO5TRIMSET) Register Mask  */


/* -------- CRU_REFO5TRIMINV : (CRU Offset: 0x13C) (R/W 32)  -------- */
#define CRU_REFO5TRIMINV_RESETVALUE           _UINT32_(0x00)                                       /*  (CRU_REFO5TRIMINV)   Reset Value */

#define CRU_REFO5TRIMINV_Msk                  _UINT32_(0x00000000)                                 /* (CRU_REFO5TRIMINV) Register Mask  */


/* -------- CRU_REFO6CON : (CRU Offset: 0x140) (R/W 32) REFERENCE OSCILLATOR 6 CONTROL REGISTER -------- */
#define CRU_REFO6CON_RESETVALUE               _UINT32_(0x00)                                       /*  (CRU_REFO6CON) REFERENCE OSCILLATOR 6 CONTROL REGISTER  Reset Value */

#define CRU_REFO6CON_ROSEL_Pos                _UINT32_(0)                                          /* (CRU_REFO6CON) Reference Clock Source Select bits Position */
#define CRU_REFO6CON_ROSEL_Msk                (_UINT32_(0xF) << CRU_REFO6CON_ROSEL_Pos)            /* (CRU_REFO6CON) Reference Clock Source Select bits Mask */
#define CRU_REFO6CON_ROSEL(value)             (CRU_REFO6CON_ROSEL_Msk & (_UINT32_(value) << CRU_REFO6CON_ROSEL_Pos)) /* Assigment of value for ROSEL in the CRU_REFO6CON register */
#define   CRU_REFO6CON_ROSEL_REFCLKI_Val      _UINT32_(0x8)                                        /* (CRU_REFO6CON) REFI Pin  */
#define   CRU_REFO6CON_ROSEL_SYSCLK_Val       _UINT32_(0x7)                                        /* (CRU_REFO6CON) System clock (reference clock reflects any device clock switching)  */
#define   CRU_REFO6CON_ROSEL_PBCLK1_Val       _UINT32_(0x6)                                        /* (CRU_REFO6CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching)  */
#define   CRU_REFO6CON_ROSEL_SPLL3_Val        _UINT32_(0x5)                                        /* (CRU_REFO6CON) System PLL3 (Clock-3)  */
#define   CRU_REFO6CON_ROSEL_LPRC_Val         _UINT32_(0x4)                                        /* (CRU_REFO6CON) LPRC  */
#define   CRU_REFO6CON_ROSEL_SOSC_Val         _UINT32_(0x3)                                        /* (CRU_REFO6CON) SOSC  */
#define   CRU_REFO6CON_ROSEL_POSC_Val         _UINT32_(0x2)                                        /* (CRU_REFO6CON) POSC  */
#define   CRU_REFO6CON_ROSEL_SPLL1_Val        _UINT32_(0x1)                                        /* (CRU_REFO6CON) System PLL1 (Clock-1)  */
#define   CRU_REFO6CON_ROSEL_FRC_Val          _UINT32_(0x0)                                        /* (CRU_REFO6CON) FRC  */
#define CRU_REFO6CON_ROSEL_REFCLKI            (CRU_REFO6CON_ROSEL_REFCLKI_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) REFI Pin Position  */
#define CRU_REFO6CON_ROSEL_SYSCLK             (CRU_REFO6CON_ROSEL_SYSCLK_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) System clock (reference clock reflects any device clock switching) Position  */
#define CRU_REFO6CON_ROSEL_PBCLK1             (CRU_REFO6CON_ROSEL_PBCLK1_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching) Position  */
#define CRU_REFO6CON_ROSEL_SPLL3              (CRU_REFO6CON_ROSEL_SPLL3_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) System PLL3 (Clock-3) Position  */
#define CRU_REFO6CON_ROSEL_LPRC               (CRU_REFO6CON_ROSEL_LPRC_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) LPRC Position  */
#define CRU_REFO6CON_ROSEL_SOSC               (CRU_REFO6CON_ROSEL_SOSC_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) SOSC Position  */
#define CRU_REFO6CON_ROSEL_POSC               (CRU_REFO6CON_ROSEL_POSC_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) POSC Position  */
#define CRU_REFO6CON_ROSEL_SPLL1              (CRU_REFO6CON_ROSEL_SPLL1_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) System PLL1 (Clock-1) Position  */
#define CRU_REFO6CON_ROSEL_FRC                (CRU_REFO6CON_ROSEL_FRC_Val << CRU_REFO6CON_ROSEL_Pos) /* (CRU_REFO6CON) FRC Position  */
#define CRU_REFO6CON_ACTIVE_Pos               _UINT32_(8)                                          /* (CRU_REFO6CON) Reference Clock Request Status bit Position */
#define CRU_REFO6CON_ACTIVE_Msk               (_UINT32_(0x1) << CRU_REFO6CON_ACTIVE_Pos)           /* (CRU_REFO6CON) Reference Clock Request Status bit Mask */
#define CRU_REFO6CON_ACTIVE(value)            (CRU_REFO6CON_ACTIVE_Msk & (_UINT32_(value) << CRU_REFO6CON_ACTIVE_Pos)) /* Assigment of value for ACTIVE in the CRU_REFO6CON register */
#define   CRU_REFO6CON_ACTIVE_ACTIVE_Val      _UINT32_(0x1)                                        /* (CRU_REFO6CON) Reference clock request is active (User should not update this REFOCON register)  */
#define   CRU_REFO6CON_ACTIVE_NOT_ACTIVE_Val  _UINT32_(0x0)                                        /* (CRU_REFO6CON) Reference clock request is not active (User can update this REFOCON register)  */
#define CRU_REFO6CON_ACTIVE_ACTIVE            (CRU_REFO6CON_ACTIVE_ACTIVE_Val << CRU_REFO6CON_ACTIVE_Pos) /* (CRU_REFO6CON) Reference clock request is active (User should not update this REFOCON register) Position  */
#define CRU_REFO6CON_ACTIVE_NOT_ACTIVE        (CRU_REFO6CON_ACTIVE_NOT_ACTIVE_Val << CRU_REFO6CON_ACTIVE_Pos) /* (CRU_REFO6CON) Reference clock request is not active (User can update this REFOCON register) Position  */
#define CRU_REFO6CON_DIVSWEN_Pos              _UINT32_(9)                                          /* (CRU_REFO6CON) Clock RODIV/ROTRIM switch enabled. Position */
#define CRU_REFO6CON_DIVSWEN_Msk              (_UINT32_(0x1) << CRU_REFO6CON_DIVSWEN_Pos)          /* (CRU_REFO6CON) Clock RODIV/ROTRIM switch enabled. Mask */
#define CRU_REFO6CON_DIVSWEN(value)           (CRU_REFO6CON_DIVSWEN_Msk & (_UINT32_(value) << CRU_REFO6CON_DIVSWEN_Pos)) /* Assigment of value for DIVSWEN in the CRU_REFO6CON register */
#define   CRU_REFO6CON_DIVSWEN_SWINPROGRESS_Val _UINT32_(0x1)                                        /* (CRU_REFO6CON) Clock Divider Switching currently in progress.  */
#define   CRU_REFO6CON_DIVSWEN_SWCOMPLETE_Val _UINT32_(0x0)                                        /* (CRU_REFO6CON) Clock Divider Switch has completed.  */
#define CRU_REFO6CON_DIVSWEN_SWINPROGRESS     (CRU_REFO6CON_DIVSWEN_SWINPROGRESS_Val << CRU_REFO6CON_DIVSWEN_Pos) /* (CRU_REFO6CON) Clock Divider Switching currently in progress. Position  */
#define CRU_REFO6CON_DIVSWEN_SWCOMPLETE       (CRU_REFO6CON_DIVSWEN_SWCOMPLETE_Val << CRU_REFO6CON_DIVSWEN_Pos) /* (CRU_REFO6CON) Clock Divider Switch has completed. Position  */
#define CRU_REFO6CON_RSLP_Pos                 _UINT32_(11)                                         /* (CRU_REFO6CON) Reference Oscillator Run in Sleep bit Position */
#define CRU_REFO6CON_RSLP_Msk                 (_UINT32_(0x1) << CRU_REFO6CON_RSLP_Pos)             /* (CRU_REFO6CON) Reference Oscillator Run in Sleep bit Mask */
#define CRU_REFO6CON_RSLP(value)              (CRU_REFO6CON_RSLP_Msk & (_UINT32_(value) << CRU_REFO6CON_RSLP_Pos)) /* Assigment of value for RSLP in the CRU_REFO6CON register */
#define   CRU_REFO6CON_RSLP_RSLP_Val          _UINT32_(0x1)                                        /* (CRU_REFO6CON) Reference Oscillator output continues to run in Sleep  */
#define   CRU_REFO6CON_RSLP_NO_RSLP_Val       _UINT32_(0x0)                                        /* (CRU_REFO6CON) Reference Oscillator output is disabled in Sleep  */
#define CRU_REFO6CON_RSLP_RSLP                (CRU_REFO6CON_RSLP_RSLP_Val << CRU_REFO6CON_RSLP_Pos) /* (CRU_REFO6CON) Reference Oscillator output continues to run in Sleep Position  */
#define CRU_REFO6CON_RSLP_NO_RSLP             (CRU_REFO6CON_RSLP_NO_RSLP_Val << CRU_REFO6CON_RSLP_Pos) /* (CRU_REFO6CON) Reference Oscillator output is disabled in Sleep Position  */
#define CRU_REFO6CON_OE_Pos                   _UINT32_(12)                                         /* (CRU_REFO6CON) Reference Clock Output Enable bit Position */
#define CRU_REFO6CON_OE_Msk                   (_UINT32_(0x1) << CRU_REFO6CON_OE_Pos)               /* (CRU_REFO6CON) Reference Clock Output Enable bit Mask */
#define CRU_REFO6CON_OE(value)                (CRU_REFO6CON_OE_Msk & (_UINT32_(value) << CRU_REFO6CON_OE_Pos)) /* Assigment of value for OE in the CRU_REFO6CON register */
#define   CRU_REFO6CON_OE_REFO6_OE_Val        _UINT32_(0x1)                                        /* (CRU_REFO6CON) Reference clock is driven out on REFO6 pin  */
#define   CRU_REFO6CON_OE_NO_REFO6_OE_Val     _UINT32_(0x0)                                        /* (CRU_REFO6CON) Reference clock is not driven out on REFO6 pin.  */
#define CRU_REFO6CON_OE_REFO6_OE              (CRU_REFO6CON_OE_REFO6_OE_Val << CRU_REFO6CON_OE_Pos) /* (CRU_REFO6CON) Reference clock is driven out on REFO6 pin Position  */
#define CRU_REFO6CON_OE_NO_REFO6_OE           (CRU_REFO6CON_OE_NO_REFO6_OE_Val << CRU_REFO6CON_OE_Pos) /* (CRU_REFO6CON) Reference clock is not driven out on REFO6 pin. Position  */
#define CRU_REFO6CON_SIDL_Pos                 _UINT32_(13)                                         /* (CRU_REFO6CON) Peripheral Stop in Idle Mode bit Position */
#define CRU_REFO6CON_SIDL_Msk                 (_UINT32_(0x1) << CRU_REFO6CON_SIDL_Pos)             /* (CRU_REFO6CON) Peripheral Stop in Idle Mode bit Mask */
#define CRU_REFO6CON_SIDL(value)              (CRU_REFO6CON_SIDL_Msk & (_UINT32_(value) << CRU_REFO6CON_SIDL_Pos)) /* Assigment of value for SIDL in the CRU_REFO6CON register */
#define   CRU_REFO6CON_SIDL_SIDL_Val          _UINT32_(0x1)                                        /* (CRU_REFO6CON) Discontinue module operation when device enters Idle mode  */
#define   CRU_REFO6CON_SIDL_NO_SIDL_Val       _UINT32_(0x0)                                        /* (CRU_REFO6CON) Continue module operation in Idle mode  */
#define CRU_REFO6CON_SIDL_SIDL                (CRU_REFO6CON_SIDL_SIDL_Val << CRU_REFO6CON_SIDL_Pos) /* (CRU_REFO6CON) Discontinue module operation when device enters Idle mode Position  */
#define CRU_REFO6CON_SIDL_NO_SIDL             (CRU_REFO6CON_SIDL_NO_SIDL_Val << CRU_REFO6CON_SIDL_Pos) /* (CRU_REFO6CON) Continue module operation in Idle mode Position  */
#define CRU_REFO6CON_FRZ_Pos                  _UINT32_(14)                                         /* (CRU_REFO6CON) Freeze in Debug mode bit Position */
#define CRU_REFO6CON_FRZ_Msk                  (_UINT32_(0x1) << CRU_REFO6CON_FRZ_Pos)              /* (CRU_REFO6CON) Freeze in Debug mode bit Mask */
#define CRU_REFO6CON_FRZ(value)               (CRU_REFO6CON_FRZ_Msk & (_UINT32_(value) << CRU_REFO6CON_FRZ_Pos)) /* Assigment of value for FRZ in the CRU_REFO6CON register */
#define   CRU_REFO6CON_FRZ_FRZ_Val            _UINT32_(0x1)                                        /* (CRU_REFO6CON) When emulator is in Debug mode, module freezes operation  */
#define   CRU_REFO6CON_FRZ_NO_FRZ_Val         _UINT32_(0x0)                                        /* (CRU_REFO6CON) When emulator is in Debug mode, module continues operation  */
#define CRU_REFO6CON_FRZ_FRZ                  (CRU_REFO6CON_FRZ_FRZ_Val << CRU_REFO6CON_FRZ_Pos)   /* (CRU_REFO6CON) When emulator is in Debug mode, module freezes operation Position  */
#define CRU_REFO6CON_FRZ_NO_FRZ               (CRU_REFO6CON_FRZ_NO_FRZ_Val << CRU_REFO6CON_FRZ_Pos) /* (CRU_REFO6CON) When emulator is in Debug mode, module continues operation Position  */
#define CRU_REFO6CON_ON_Pos                   _UINT32_(15)                                         /* (CRU_REFO6CON) Output Enable bit Position */
#define CRU_REFO6CON_ON_Msk                   (_UINT32_(0x1) << CRU_REFO6CON_ON_Pos)               /* (CRU_REFO6CON) Output Enable bit Mask */
#define CRU_REFO6CON_ON(value)                (CRU_REFO6CON_ON_Msk & (_UINT32_(value) << CRU_REFO6CON_ON_Pos)) /* Assigment of value for ON in the CRU_REFO6CON register */
#define   CRU_REFO6CON_ON_ON_Val              _UINT32_(0x1)                                        /* (CRU_REFO6CON) Reference Oscillator Module enabled  */
#define   CRU_REFO6CON_ON_OFF_Val             _UINT32_(0x0)                                        /* (CRU_REFO6CON) Reference Oscillator Module disabled  */
#define CRU_REFO6CON_ON_ON                    (CRU_REFO6CON_ON_ON_Val << CRU_REFO6CON_ON_Pos)      /* (CRU_REFO6CON) Reference Oscillator Module enabled Position  */
#define CRU_REFO6CON_ON_OFF                   (CRU_REFO6CON_ON_OFF_Val << CRU_REFO6CON_ON_Pos)     /* (CRU_REFO6CON) Reference Oscillator Module disabled Position  */
#define CRU_REFO6CON_RODIV_Pos                _UINT32_(16)                                         /* (CRU_REFO6CON) Reference Clock Divider bits Position */
#define CRU_REFO6CON_RODIV_Msk                (_UINT32_(0x7FFF) << CRU_REFO6CON_RODIV_Pos)         /* (CRU_REFO6CON) Reference Clock Divider bits Mask */
#define CRU_REFO6CON_RODIV(value)             (CRU_REFO6CON_RODIV_Msk & (_UINT32_(value) << CRU_REFO6CON_RODIV_Pos)) /* Assigment of value for RODIV in the CRU_REFO6CON register */
#define   CRU_REFO6CON_RODIV_65K_Val          _UINT32_(0x7FFF)                                     /* (CRU_REFO6CON) REFO6 clock is Base clock frequency divided by 65,534 (32,767 *2)  */
#define   CRU_REFO6CON_RODIV_4_Val            _UINT32_(0x2)                                        /* (CRU_REFO6CON) REFO6 clock is Base clock frequency divided by 4 (2*2)  */
#define   CRU_REFO6CON_RODIV_2_Val            _UINT32_(0x1)                                        /* (CRU_REFO6CON) REFO6 clock is Base clock frequency divided by 2 (1*2)  */
#define   CRU_REFO6CON_RODIV_NONE_Val         _UINT32_(0x0)                                        /* (CRU_REFO6CON) REFO6 clock is same frequency as Base clock (no divider)  */
#define CRU_REFO6CON_RODIV_65K                (CRU_REFO6CON_RODIV_65K_Val << CRU_REFO6CON_RODIV_Pos) /* (CRU_REFO6CON) REFO6 clock is Base clock frequency divided by 65,534 (32,767 *2) Position  */
#define CRU_REFO6CON_RODIV_4                  (CRU_REFO6CON_RODIV_4_Val << CRU_REFO6CON_RODIV_Pos) /* (CRU_REFO6CON) REFO6 clock is Base clock frequency divided by 4 (2*2) Position  */
#define CRU_REFO6CON_RODIV_2                  (CRU_REFO6CON_RODIV_2_Val << CRU_REFO6CON_RODIV_Pos) /* (CRU_REFO6CON) REFO6 clock is Base clock frequency divided by 2 (1*2) Position  */
#define CRU_REFO6CON_RODIV_NONE               (CRU_REFO6CON_RODIV_NONE_Val << CRU_REFO6CON_RODIV_Pos) /* (CRU_REFO6CON) REFO6 clock is same frequency as Base clock (no divider) Position  */
#define CRU_REFO6CON_Msk                      _UINT32_(0x7FFFFB0F)                                 /* (CRU_REFO6CON) Register Mask  */


