Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/cru.h
/* -------- CRU_PB1DIVCLR : (CRU Offset: 0x164) (R/W 32)  -------- */
#define CRU_PB1DIVCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB1DIVCLR)   Reset Value */

#define CRU_PB1DIVCLR_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB1DIVCLR) Register Mask  */


/* -------- CRU_PB1DIVSET : (CRU Offset: 0x168) (R/W 32)  -------- */
#define CRU_PB1DIVSET_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB1DIVSET)   Reset Value */

#define CRU_PB1DIVSET_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB1DIVSET) Register Mask  */


/* -------- CRU_PB1DIVINV : (CRU Offset: 0x16C) (R/W 32)  -------- */
#define CRU_PB1DIVINV_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB1DIVINV)   Reset Value */

#define CRU_PB1DIVINV_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB1DIVINV) Register Mask  */


/* -------- CRU_PB2DIV : (CRU Offset: 0x170) (R/W 32) PB2 CLOCK DIVISOR CONTROL REGISTER -------- */
#define CRU_PB2DIV_RESETVALUE                 _UINT32_(0x8801)                                     /*  (CRU_PB2DIV) PB2 CLOCK DIVISOR CONTROL REGISTER  Reset Value */

#define CRU_PB2DIV_PBDIV_Pos                  _UINT32_(0)                                          /* (CRU_PB2DIV) PB2 Peripheral Clock Divisor Control value Position */
#define CRU_PB2DIV_PBDIV_Msk                  (_UINT32_(0x7F) << CRU_PB2DIV_PBDIV_Pos)             /* (CRU_PB2DIV) PB2 Peripheral Clock Divisor Control value Mask */
#define CRU_PB2DIV_PBDIV(value)               (CRU_PB2DIV_PBDIV_Msk & (_UINT32_(value) << CRU_PB2DIV_PBDIV_Pos)) /* Assigment of value for PBDIV in the CRU_PB2DIV register */
#define   CRU_PB2DIV_PBDIV_DIV1_Val           _UINT32_(0x0)                                        /* (CRU_PB2DIV) Divide by 1 PB2 Clock same frequency as sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV2_Val           _UINT32_(0x1)                                        /* (CRU_PB2DIV) Divide by 2 PB2 Clock is 1/2 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV3_Val           _UINT32_(0x2)                                        /* (CRU_PB2DIV) Divide by 3 PB2 Clock is 1/3 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV16_Val          _UINT32_(0xF)                                        /* (CRU_PB2DIV) Divide by 16 PB2 Clock is 1/16 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV17_Val          _UINT32_(0x10)                                       /* (CRU_PB2DIV) Divide by 17 PB2 Clock is 1/17 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV127_Val         _UINT32_(0x7E)                                       /* (CRU_PB2DIV) Divide by 127 PB2 Clock is 1/127 of sys_clk  */
#define   CRU_PB2DIV_PBDIV_DIV128_Val         _UINT32_(0x7F)                                       /* (CRU_PB2DIV) Divide by 128 PB2 Clock is 1/128 of sys_clk  */
#define CRU_PB2DIV_PBDIV_DIV1                 (CRU_PB2DIV_PBDIV_DIV1_Val << CRU_PB2DIV_PBDIV_Pos)  /* (CRU_PB2DIV) Divide by 1 PB2 Clock same frequency as sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV2                 (CRU_PB2DIV_PBDIV_DIV2_Val << CRU_PB2DIV_PBDIV_Pos)  /* (CRU_PB2DIV) Divide by 2 PB2 Clock is 1/2 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV3                 (CRU_PB2DIV_PBDIV_DIV3_Val << CRU_PB2DIV_PBDIV_Pos)  /* (CRU_PB2DIV) Divide by 3 PB2 Clock is 1/3 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV16                (CRU_PB2DIV_PBDIV_DIV16_Val << CRU_PB2DIV_PBDIV_Pos) /* (CRU_PB2DIV) Divide by 16 PB2 Clock is 1/16 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV17                (CRU_PB2DIV_PBDIV_DIV17_Val << CRU_PB2DIV_PBDIV_Pos) /* (CRU_PB2DIV) Divide by 17 PB2 Clock is 1/17 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV127               (CRU_PB2DIV_PBDIV_DIV127_Val << CRU_PB2DIV_PBDIV_Pos) /* (CRU_PB2DIV) Divide by 127 PB2 Clock is 1/127 of sys_clk Position  */
#define CRU_PB2DIV_PBDIV_DIV128               (CRU_PB2DIV_PBDIV_DIV128_Val << CRU_PB2DIV_PBDIV_Pos) /* (CRU_PB2DIV) Divide by 128 PB2 Clock is 1/128 of sys_clk Position  */
#define CRU_PB2DIV_PBDIVRDY_Pos               _UINT32_(11)                                         /* (CRU_PB2DIV) PB2 Peripheral Clock Divisor Ready Position */
#define CRU_PB2DIV_PBDIVRDY_Msk               (_UINT32_(0x1) << CRU_PB2DIV_PBDIVRDY_Pos)           /* (CRU_PB2DIV) PB2 Peripheral Clock Divisor Ready Mask */
#define CRU_PB2DIV_PBDIVRDY(value)            (CRU_PB2DIV_PBDIVRDY_Msk & (_UINT32_(value) << CRU_PB2DIV_PBDIVRDY_Pos)) /* Assigment of value for PBDIVRDY in the CRU_PB2DIV register */
#define   CRU_PB2DIV_PBDIVRDY_PB2RDY_Val      _UINT32_(0x1)                                        /* (CRU_PB2DIV) Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written.  */
#define   CRU_PB2DIV_PBDIVRDY_NOT_PB2RDY_Val  _UINT32_(0x0)                                        /* (CRU_PB2DIV) Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written.  */
#define CRU_PB2DIV_PBDIVRDY_PB2RDY            (CRU_PB2DIV_PBDIVRDY_PB2RDY_Val << CRU_PB2DIV_PBDIVRDY_Pos) /* (CRU_PB2DIV) Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written. Position  */
#define CRU_PB2DIV_PBDIVRDY_NOT_PB2RDY        (CRU_PB2DIV_PBDIVRDY_NOT_PB2RDY_Val << CRU_PB2DIV_PBDIVRDY_Pos) /* (CRU_PB2DIV) Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written. Position  */
#define CRU_PB2DIV_PBDIVON_Pos                _UINT32_(15)                                         /* (CRU_PB2DIV) Output Enable bit Position */
#define CRU_PB2DIV_PBDIVON_Msk                (_UINT32_(0x1) << CRU_PB2DIV_PBDIVON_Pos)            /* (CRU_PB2DIV) Output Enable bit Mask */
#define CRU_PB2DIV_PBDIVON(value)             (CRU_PB2DIV_PBDIVON_Msk & (_UINT32_(value) << CRU_PB2DIV_PBDIVON_Pos)) /* Assigment of value for PBDIVON in the CRU_PB2DIV register */
#define   CRU_PB2DIV_PBDIVON_PB2ON_Val        _UINT32_(0x1)                                        /* (CRU_PB2DIV) PB2 Output clock is enabled  */
#define   CRU_PB2DIV_PBDIVON_PB2OFF_Val       _UINT32_(0x0)                                        /* (CRU_PB2DIV) PB2 Output clock is disabled  */
#define CRU_PB2DIV_PBDIVON_PB2ON              (CRU_PB2DIV_PBDIVON_PB2ON_Val << CRU_PB2DIV_PBDIVON_Pos) /* (CRU_PB2DIV) PB2 Output clock is enabled Position  */
#define CRU_PB2DIV_PBDIVON_PB2OFF             (CRU_PB2DIV_PBDIVON_PB2OFF_Val << CRU_PB2DIV_PBDIVON_Pos) /* (CRU_PB2DIV) PB2 Output clock is disabled Position  */
#define CRU_PB2DIV_Msk                        _UINT32_(0x0000887F)                                 /* (CRU_PB2DIV) Register Mask  */


/* -------- CRU_PB2DIVCLR : (CRU Offset: 0x174) (R/W 32)  -------- */
#define CRU_PB2DIVCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB2DIVCLR)   Reset Value */

#define CRU_PB2DIVCLR_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB2DIVCLR) Register Mask  */


/* -------- CRU_PB2DIVSET : (CRU Offset: 0x178) (R/W 32)  -------- */
#define CRU_PB2DIVSET_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB2DIVSET)   Reset Value */

#define CRU_PB2DIVSET_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB2DIVSET) Register Mask  */


/* -------- CRU_PB2DIVINV : (CRU Offset: 0x17C) (R/W 32)  -------- */
#define CRU_PB2DIVINV_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB2DIVINV)   Reset Value */

#define CRU_PB2DIVINV_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB2DIVINV) Register Mask  */


/* -------- CRU_PB3DIV : (CRU Offset: 0x180) (R/W 32) PB3 CLOCK DIVISOR CONTROL REGISTER -------- */
#define CRU_PB3DIV_RESETVALUE                 _UINT32_(0x8813)                                     /*  (CRU_PB3DIV) PB3 CLOCK DIVISOR CONTROL REGISTER  Reset Value */

