Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/cru.h
#define CRU_PB4DIVCLR_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB4DIVCLR) Register Mask  */


/* -------- CRU_PB4DIVSET : (CRU Offset: 0x198) (R/W 32)  -------- */
#define CRU_PB4DIVSET_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB4DIVSET)   Reset Value */

#define CRU_PB4DIVSET_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB4DIVSET) Register Mask  */


/* -------- CRU_PB4DIVINV : (CRU Offset: 0x19C) (R/W 32)  -------- */
#define CRU_PB4DIVINV_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB4DIVINV)   Reset Value */

#define CRU_PB4DIVINV_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB4DIVINV) Register Mask  */


/* -------- CRU_PB5DIV : (CRU Offset: 0x1A0) (R/W 32) PB5 CLOCK DIVISOR CONTROL REGISTER -------- */
#define CRU_PB5DIV_RESETVALUE                 _UINT32_(0x8801)                                     /*  (CRU_PB5DIV) PB5 CLOCK DIVISOR CONTROL REGISTER  Reset Value */

#define CRU_PB5DIV_PBDIV_Pos                  _UINT32_(0)                                          /* (CRU_PB5DIV) PB5 Peripheral Clock Divisor Control value Position */
#define CRU_PB5DIV_PBDIV_Msk                  (_UINT32_(0x7F) << CRU_PB5DIV_PBDIV_Pos)             /* (CRU_PB5DIV) PB5 Peripheral Clock Divisor Control value Mask */
#define CRU_PB5DIV_PBDIV(value)               (CRU_PB5DIV_PBDIV_Msk & (_UINT32_(value) << CRU_PB5DIV_PBDIV_Pos)) /* Assigment of value for PBDIV in the CRU_PB5DIV register */
#define   CRU_PB5DIV_PBDIV_DIV1_Val           _UINT32_(0x0)                                        /* (CRU_PB5DIV) Divide by 1 PB5 Clock same frequency as sys_clk  */
#define   CRU_PB5DIV_PBDIV_DIV2_Val           _UINT32_(0x1)                                        /* (CRU_PB5DIV) Divide by 2 PB5 Clock is 1/2 of sys_clk  */
#define   CRU_PB5DIV_PBDIV_DIV3_Val           _UINT32_(0x2)                                        /* (CRU_PB5DIV) Divide by 3 PB5 Clock is 1/3 of sys_clk  */
#define   CRU_PB5DIV_PBDIV_DIV16_Val          _UINT32_(0xF)                                        /* (CRU_PB5DIV) Divide by 16 PB5 Clock is 1/16 of sys_clk  */
#define   CRU_PB5DIV_PBDIV_DIV17_Val          _UINT32_(0x10)                                       /* (CRU_PB5DIV) Divide by 17 PB5 Clock is 1/17 of sys_clk  */
#define   CRU_PB5DIV_PBDIV_DIV127_Val         _UINT32_(0x7E)                                       /* (CRU_PB5DIV) Divide by 127 PB5 Clock is 1/127 of sys_clk  */
#define   CRU_PB5DIV_PBDIV_DIV128_Val         _UINT32_(0x7F)                                       /* (CRU_PB5DIV) Divide by 128 PB5 Clock is 1/128 of sys_clk  */
#define CRU_PB5DIV_PBDIV_DIV1                 (CRU_PB5DIV_PBDIV_DIV1_Val << CRU_PB5DIV_PBDIV_Pos)  /* (CRU_PB5DIV) Divide by 1 PB5 Clock same frequency as sys_clk Position  */
#define CRU_PB5DIV_PBDIV_DIV2                 (CRU_PB5DIV_PBDIV_DIV2_Val << CRU_PB5DIV_PBDIV_Pos)  /* (CRU_PB5DIV) Divide by 2 PB5 Clock is 1/2 of sys_clk Position  */
#define CRU_PB5DIV_PBDIV_DIV3                 (CRU_PB5DIV_PBDIV_DIV3_Val << CRU_PB5DIV_PBDIV_Pos)  /* (CRU_PB5DIV) Divide by 3 PB5 Clock is 1/3 of sys_clk Position  */
#define CRU_PB5DIV_PBDIV_DIV16                (CRU_PB5DIV_PBDIV_DIV16_Val << CRU_PB5DIV_PBDIV_Pos) /* (CRU_PB5DIV) Divide by 16 PB5 Clock is 1/16 of sys_clk Position  */
#define CRU_PB5DIV_PBDIV_DIV17                (CRU_PB5DIV_PBDIV_DIV17_Val << CRU_PB5DIV_PBDIV_Pos) /* (CRU_PB5DIV) Divide by 17 PB5 Clock is 1/17 of sys_clk Position  */
#define CRU_PB5DIV_PBDIV_DIV127               (CRU_PB5DIV_PBDIV_DIV127_Val << CRU_PB5DIV_PBDIV_Pos) /* (CRU_PB5DIV) Divide by 127 PB5 Clock is 1/127 of sys_clk Position  */
#define CRU_PB5DIV_PBDIV_DIV128               (CRU_PB5DIV_PBDIV_DIV128_Val << CRU_PB5DIV_PBDIV_Pos) /* (CRU_PB5DIV) Divide by 128 PB5 Clock is 1/128 of sys_clk Position  */
#define CRU_PB5DIV_PBDIVRDY_Pos               _UINT32_(11)                                         /* (CRU_PB5DIV) PB5 Peripheral Clock Divisor Ready Position */
#define CRU_PB5DIV_PBDIVRDY_Msk               (_UINT32_(0x1) << CRU_PB5DIV_PBDIVRDY_Pos)           /* (CRU_PB5DIV) PB5 Peripheral Clock Divisor Ready Mask */
#define CRU_PB5DIV_PBDIVRDY(value)            (CRU_PB5DIV_PBDIVRDY_Msk & (_UINT32_(value) << CRU_PB5DIV_PBDIVRDY_Pos)) /* Assigment of value for PBDIVRDY in the CRU_PB5DIV register */
#define   CRU_PB5DIV_PBDIVRDY_PB5RDY_Val      _UINT32_(0x1)                                        /* (CRU_PB5DIV) Indicates the PB clock divisor logic is not switching divisors and the PB5DIV may be written.  */
#define   CRU_PB5DIV_PBDIVRDY_NOT_PB5RDY_Val  _UINT32_(0x0)                                        /* (CRU_PB5DIV) Indicates the PB clock divisor logic is currently switching values and the PB5DIV cannot be written.  */
#define CRU_PB5DIV_PBDIVRDY_PB5RDY            (CRU_PB5DIV_PBDIVRDY_PB5RDY_Val << CRU_PB5DIV_PBDIVRDY_Pos) /* (CRU_PB5DIV) Indicates the PB clock divisor logic is not switching divisors and the PB5DIV may be written. Position  */
#define CRU_PB5DIV_PBDIVRDY_NOT_PB5RDY        (CRU_PB5DIV_PBDIVRDY_NOT_PB5RDY_Val << CRU_PB5DIV_PBDIVRDY_Pos) /* (CRU_PB5DIV) Indicates the PB clock divisor logic is currently switching values and the PB5DIV cannot be written. Position  */
#define CRU_PB5DIV_PBDIVON_Pos                _UINT32_(15)                                         /* (CRU_PB5DIV) Output Enable bit Position */
#define CRU_PB5DIV_PBDIVON_Msk                (_UINT32_(0x1) << CRU_PB5DIV_PBDIVON_Pos)            /* (CRU_PB5DIV) Output Enable bit Mask */
#define CRU_PB5DIV_PBDIVON(value)             (CRU_PB5DIV_PBDIVON_Msk & (_UINT32_(value) << CRU_PB5DIV_PBDIVON_Pos)) /* Assigment of value for PBDIVON in the CRU_PB5DIV register */
#define   CRU_PB5DIV_PBDIVON_PB5ON_Val        _UINT32_(0x1)                                        /* (CRU_PB5DIV) PB5 Output clock is enabled  */
#define   CRU_PB5DIV_PBDIVON_PB5OFF_Val       _UINT32_(0x0)                                        /* (CRU_PB5DIV) PB5 Output clock is disabled  */
#define CRU_PB5DIV_PBDIVON_PB5ON              (CRU_PB5DIV_PBDIVON_PB5ON_Val << CRU_PB5DIV_PBDIVON_Pos) /* (CRU_PB5DIV) PB5 Output clock is enabled Position  */
#define CRU_PB5DIV_PBDIVON_PB5OFF             (CRU_PB5DIV_PBDIVON_PB5OFF_Val << CRU_PB5DIV_PBDIVON_Pos) /* (CRU_PB5DIV) PB5 Output clock is disabled Position  */
#define CRU_PB5DIV_Msk                        _UINT32_(0x0000887F)                                 /* (CRU_PB5DIV) Register Mask  */


/* -------- CRU_PB5DIVCLR : (CRU Offset: 0x1A4) (R/W 32)  -------- */
#define CRU_PB5DIVCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB5DIVCLR)   Reset Value */

#define CRU_PB5DIVCLR_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB5DIVCLR) Register Mask  */


/* -------- CRU_PB5DIVSET : (CRU Offset: 0x1A8) (R/W 32)  -------- */
#define CRU_PB5DIVSET_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB5DIVSET)   Reset Value */

#define CRU_PB5DIVSET_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB5DIVSET) Register Mask  */


/* -------- CRU_PB5DIVINV : (CRU Offset: 0x1AC) (R/W 32)  -------- */
#define CRU_PB5DIVINV_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB5DIVINV)   Reset Value */

