Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/cru.h
/* -------- CRU_CLKSTATSET : (CRU Offset: 0x1C8) (R/W 32)  -------- */
#define CRU_CLKSTATSET_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_CLKSTATSET)   Reset Value */

#define CRU_CLKSTATSET_Msk                    _UINT32_(0x00000000)                                 /* (CRU_CLKSTATSET) Register Mask  */


/* -------- CRU_CLKSTATINV : (CRU Offset: 0x1CC) (R/W 32)  -------- */
#define CRU_CLKSTATINV_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_CLKSTATINV)   Reset Value */

#define CRU_CLKSTATINV_Msk                    _UINT32_(0x00000000)                                 /* (CRU_CLKSTATINV) Register Mask  */


/* -------- CRU_CLKDIAG : (CRU Offset: 0x1E0) (R/W 32) USER CLK DIAGNOSTICS CONTROL REGISTER -------- */
#define CRU_CLKDIAG_RESETVALUE                _UINT32_(0x00)                                       /*  (CRU_CLKDIAG) USER CLK DIAGNOSTICS CONTROL REGISTER  Reset Value */

#define CRU_CLKDIAG_POSCSTOP_Pos              _UINT32_(0)                                          /* (CRU_CLKDIAG) POSC Clock Stop Control value Position */
#define CRU_CLKDIAG_POSCSTOP_Msk              (_UINT32_(0x1) << CRU_CLKDIAG_POSCSTOP_Pos)          /* (CRU_CLKDIAG) POSC Clock Stop Control value Mask */
#define CRU_CLKDIAG_POSCSTOP(value)           (CRU_CLKDIAG_POSCSTOP_Msk & (_UINT32_(value) << CRU_CLKDIAG_POSCSTOP_Pos)) /* Assigment of value for POSCSTOP in the CRU_CLKDIAG register */
#define   CRU_CLKDIAG_POSCSTOP_NORM_Val       _UINT32_(0x0)                                        /* (CRU_CLKDIAG) POSC clock source runs as normal  */
#define   CRU_CLKDIAG_POSCSTOP_STOP_Val       _UINT32_(0x1)                                        /* (CRU_CLKDIAG) POSC clock source is stopped  */
#define CRU_CLKDIAG_POSCSTOP_NORM             (CRU_CLKDIAG_POSCSTOP_NORM_Val << CRU_CLKDIAG_POSCSTOP_Pos) /* (CRU_CLKDIAG) POSC clock source runs as normal Position  */
#define CRU_CLKDIAG_POSCSTOP_STOP             (CRU_CLKDIAG_POSCSTOP_STOP_Val << CRU_CLKDIAG_POSCSTOP_Pos) /* (CRU_CLKDIAG) POSC clock source is stopped Position  */
#define CRU_CLKDIAG_SOSCSTOP_Pos              _UINT32_(1)                                          /* (CRU_CLKDIAG) SOSC Clock Stop Control value Position */
#define CRU_CLKDIAG_SOSCSTOP_Msk              (_UINT32_(0x1) << CRU_CLKDIAG_SOSCSTOP_Pos)          /* (CRU_CLKDIAG) SOSC Clock Stop Control value Mask */
#define CRU_CLKDIAG_SOSCSTOP(value)           (CRU_CLKDIAG_SOSCSTOP_Msk & (_UINT32_(value) << CRU_CLKDIAG_SOSCSTOP_Pos)) /* Assigment of value for SOSCSTOP in the CRU_CLKDIAG register */
#define   CRU_CLKDIAG_SOSCSTOP_NORM_Val       _UINT32_(0x0)                                        /* (CRU_CLKDIAG) SOSC clock source runs as normal  */
#define   CRU_CLKDIAG_SOSCSTOP_STOP_Val       _UINT32_(0x1)                                        /* (CRU_CLKDIAG) SOSC clock source is stopped  */
#define CRU_CLKDIAG_SOSCSTOP_NORM             (CRU_CLKDIAG_SOSCSTOP_NORM_Val << CRU_CLKDIAG_SOSCSTOP_Pos) /* (CRU_CLKDIAG) SOSC clock source runs as normal Position  */
#define CRU_CLKDIAG_SOSCSTOP_STOP             (CRU_CLKDIAG_SOSCSTOP_STOP_Val << CRU_CLKDIAG_SOSCSTOP_Pos) /* (CRU_CLKDIAG) SOSC clock source is stopped Position  */
#define CRU_CLKDIAG_FRCSTOP_Pos               _UINT32_(2)                                          /* (CRU_CLKDIAG) FRC Clock Stop Control value Position */
#define CRU_CLKDIAG_FRCSTOP_Msk               (_UINT32_(0x1) << CRU_CLKDIAG_FRCSTOP_Pos)           /* (CRU_CLKDIAG) FRC Clock Stop Control value Mask */
#define CRU_CLKDIAG_FRCSTOP(value)            (CRU_CLKDIAG_FRCSTOP_Msk & (_UINT32_(value) << CRU_CLKDIAG_FRCSTOP_Pos)) /* Assigment of value for FRCSTOP in the CRU_CLKDIAG register */
#define   CRU_CLKDIAG_FRCSTOP_NORM_Val        _UINT32_(0x0)                                        /* (CRU_CLKDIAG) FRC clock source runs as normal  */
#define   CRU_CLKDIAG_FRCSTOP_STOP_Val        _UINT32_(0x1)                                        /* (CRU_CLKDIAG) FRC clock source is stopped  */
#define CRU_CLKDIAG_FRCSTOP_NORM              (CRU_CLKDIAG_FRCSTOP_NORM_Val << CRU_CLKDIAG_FRCSTOP_Pos) /* (CRU_CLKDIAG) FRC clock source runs as normal Position  */
#define CRU_CLKDIAG_FRCSTOP_STOP              (CRU_CLKDIAG_FRCSTOP_STOP_Val << CRU_CLKDIAG_FRCSTOP_Pos) /* (CRU_CLKDIAG) FRC clock source is stopped Position  */
#define CRU_CLKDIAG_LPRCSTOP_Pos              _UINT32_(3)                                          /* (CRU_CLKDIAG) LPRC Clock Stop Control value Position */
#define CRU_CLKDIAG_LPRCSTOP_Msk              (_UINT32_(0x1) << CRU_CLKDIAG_LPRCSTOP_Pos)          /* (CRU_CLKDIAG) LPRC Clock Stop Control value Mask */
#define CRU_CLKDIAG_LPRCSTOP(value)           (CRU_CLKDIAG_LPRCSTOP_Msk & (_UINT32_(value) << CRU_CLKDIAG_LPRCSTOP_Pos)) /* Assigment of value for LPRCSTOP in the CRU_CLKDIAG register */
#define   CRU_CLKDIAG_LPRCSTOP_NORM_Val       _UINT32_(0x0)                                        /* (CRU_CLKDIAG) LPRC clock source runs as normal  */
#define   CRU_CLKDIAG_LPRCSTOP_STOP_Val       _UINT32_(0x1)                                        /* (CRU_CLKDIAG) LPRC clock source is stopped  */
#define CRU_CLKDIAG_LPRCSTOP_NORM             (CRU_CLKDIAG_LPRCSTOP_NORM_Val << CRU_CLKDIAG_LPRCSTOP_Pos) /* (CRU_CLKDIAG) LPRC clock source runs as normal Position  */
#define CRU_CLKDIAG_LPRCSTOP_STOP             (CRU_CLKDIAG_LPRCSTOP_STOP_Val << CRU_CLKDIAG_LPRCSTOP_Pos) /* (CRU_CLKDIAG) LPRC clock source is stopped Position  */
#define CRU_CLKDIAG_SPLL1STOP_Pos             _UINT32_(4)                                          /* (CRU_CLKDIAG) SPLL1 Clock Stop Control value Position */
#define CRU_CLKDIAG_SPLL1STOP_Msk             (_UINT32_(0x1) << CRU_CLKDIAG_SPLL1STOP_Pos)         /* (CRU_CLKDIAG) SPLL1 Clock Stop Control value Mask */
#define CRU_CLKDIAG_SPLL1STOP(value)          (CRU_CLKDIAG_SPLL1STOP_Msk & (_UINT32_(value) << CRU_CLKDIAG_SPLL1STOP_Pos)) /* Assigment of value for SPLL1STOP in the CRU_CLKDIAG register */
#define   CRU_CLKDIAG_SPLL1STOP_NORM_Val      _UINT32_(0x0)                                        /* (CRU_CLKDIAG) SPLL1 clock source runs as normal  */
#define   CRU_CLKDIAG_SPLL1STOP_STOP_Val      _UINT32_(0x1)                                        /* (CRU_CLKDIAG) SPLL1 clock source is stopped  */
#define CRU_CLKDIAG_SPLL1STOP_NORM            (CRU_CLKDIAG_SPLL1STOP_NORM_Val << CRU_CLKDIAG_SPLL1STOP_Pos) /* (CRU_CLKDIAG) SPLL1 clock source runs as normal Position  */
#define CRU_CLKDIAG_SPLL1STOP_STOP            (CRU_CLKDIAG_SPLL1STOP_STOP_Val << CRU_CLKDIAG_SPLL1STOP_Pos) /* (CRU_CLKDIAG) SPLL1 clock source is stopped Position  */
#define CRU_CLKDIAG_EPLLSTOP_Pos              _UINT32_(5)                                          /* (CRU_CLKDIAG) EPLL Clock Stop Control value Position */
#define CRU_CLKDIAG_EPLLSTOP_Msk              (_UINT32_(0x1) << CRU_CLKDIAG_EPLLSTOP_Pos)          /* (CRU_CLKDIAG) EPLL Clock Stop Control value Mask */
#define CRU_CLKDIAG_EPLLSTOP(value)           (CRU_CLKDIAG_EPLLSTOP_Msk & (_UINT32_(value) << CRU_CLKDIAG_EPLLSTOP_Pos)) /* Assigment of value for EPLLSTOP in the CRU_CLKDIAG register */
#define   CRU_CLKDIAG_EPLLSTOP_NORM_Val       _UINT32_(0x0)                                        /* (CRU_CLKDIAG) EPLL clock source runs as normal  */
#define   CRU_CLKDIAG_EPLLSTOP_STOP_Val       _UINT32_(0x1)                                        /* (CRU_CLKDIAG) EPLL clock source is stopped  */
#define CRU_CLKDIAG_EPLLSTOP_NORM             (CRU_CLKDIAG_EPLLSTOP_NORM_Val << CRU_CLKDIAG_EPLLSTOP_Pos) /* (CRU_CLKDIAG) EPLL clock source runs as normal Position  */
#define CRU_CLKDIAG_EPLLSTOP_STOP             (CRU_CLKDIAG_EPLLSTOP_STOP_Val << CRU_CLKDIAG_EPLLSTOP_Pos) /* (CRU_CLKDIAG) EPLL clock source is stopped Position  */
#define CRU_CLKDIAG_UPLLSTOP_Pos              _UINT32_(6)                                          /* (CRU_CLKDIAG) UPLL Clock Stop Control value Position */
#define CRU_CLKDIAG_UPLLSTOP_Msk              (_UINT32_(0x1) << CRU_CLKDIAG_UPLLSTOP_Pos)          /* (CRU_CLKDIAG) UPLL Clock Stop Control value Mask */
#define CRU_CLKDIAG_UPLLSTOP(value)           (CRU_CLKDIAG_UPLLSTOP_Msk & (_UINT32_(value) << CRU_CLKDIAG_UPLLSTOP_Pos)) /* Assigment of value for UPLLSTOP in the CRU_CLKDIAG register */
#define   CRU_CLKDIAG_UPLLSTOP_NORM_Val       _UINT32_(0x0)                                        /* (CRU_CLKDIAG) UPLL clock source runs as normal  */
#define   CRU_CLKDIAG_UPLLSTOP_STOP_Val       _UINT32_(0x1)                                        /* (CRU_CLKDIAG) UPLL clock source is stopped  */
#define CRU_CLKDIAG_UPLLSTOP_NORM             (CRU_CLKDIAG_UPLLSTOP_NORM_Val << CRU_CLKDIAG_UPLLSTOP_Pos) /* (CRU_CLKDIAG) UPLL clock source runs as normal Position  */
#define CRU_CLKDIAG_UPLLSTOP_STOP             (CRU_CLKDIAG_UPLLSTOP_STOP_Val << CRU_CLKDIAG_UPLLSTOP_Pos) /* (CRU_CLKDIAG) UPLL clock source is stopped Position  */
#define CRU_CLKDIAG_NMICNT_Pos                _UINT32_(16)                                         /* (CRU_CLKDIAG) NMI Counter value Position */
#define CRU_CLKDIAG_NMICNT_Msk                (_UINT32_(0xFFFF) << CRU_CLKDIAG_NMICNT_Pos)         /* (CRU_CLKDIAG) NMI Counter value Mask */
#define CRU_CLKDIAG_NMICNT(value)             (CRU_CLKDIAG_NMICNT_Msk & (_UINT32_(value) << CRU_CLKDIAG_NMICNT_Pos)) /* Assigment of value for NMICNT in the CRU_CLKDIAG register */
#define CRU_CLKDIAG_Msk                       _UINT32_(0xFFFF007F)                                 /* (CRU_CLKDIAG) Register Mask  */


/* -------- CRU_CLKDIAGCLR : (CRU Offset: 0x1E4) (R/W 32)  -------- */
#define CRU_CLKDIAGCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_CLKDIAGCLR)   Reset Value */

