Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/cru.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CRU register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       CRU_OSCCON;         /**< Offset: 0x00 (R/W  32) CRU OSCILLATOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_OSCCONCLR;      /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       CRU_OSCCONSET;      /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       CRU_OSCCONINV;      /**< Offset: 0x0C (R/W  32)  */
  __IO  uint32_t                       CRU_OSCTUN;         /**< Offset: 0x10 (R/W  32) CRU OSCILLATOR TRIMMING REGISTER */
  __IO  uint32_t                       CRU_OSCTUNCLR;      /**< Offset: 0x14 (R/W  32)  */
  __IO  uint32_t                       CRU_OSCTUNSET;      /**< Offset: 0x18 (R/W  32)  */
  __IO  uint32_t                       CRU_OSCTUNINV;      /**< Offset: 0x1C (R/W  32)  */
  __IO  uint32_t                       CRU_SPLLCON;        /**< Offset: 0x20 (R/W  32) SPLL CONTROL REGISTER */
  __IO  uint32_t                       CRU_SPLLCONCLR;     /**< Offset: 0x24 (R/W  32)  */
  __IO  uint32_t                       CRU_SPLLCONSET;     /**< Offset: 0x28 (R/W  32)  */
  __IO  uint32_t                       CRU_SPLLCONINV;     /**< Offset: 0x2C (R/W  32)  */
  __IO  uint32_t                       CRU_UPLLCON;        /**< Offset: 0x30 (R/W  32) UPLL CONTROL REGISTER */
  __IO  uint32_t                       CRU_UPLLCONCLR;     /**< Offset: 0x34 (R/W  32)  */
  __IO  uint32_t                       CRU_UPLLCONSET;     /**< Offset: 0x38 (R/W  32)  */
  __IO  uint32_t                       CRU_UPLLCONINV;     /**< Offset: 0x3C (R/W  32)  */
  __IO  uint32_t                       CRU_EPLLCON;        /**< Offset: 0x40 (R/W  32) EPLL CONTROL REGISTER */
  __IO  uint32_t                       CRU_EPLLCONCLR;     /**< Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       CRU_EPLLCONSET;     /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       CRU_EPLLCONINV;     /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       CRU_APLLCON;        /**< Offset: 0x50 (R/W  32) APLL CONTROL REGISTER */
  __IO  uint32_t                       CRU_APLLCONCLR;     /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       CRU_APLLCONSET;     /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       CRU_APLLCONINV;     /**< Offset: 0x5C (R/W  32)  */
  __I   uint8_t                        Reserved1[0x40];
  __IO  uint32_t                       CRU_REFO1CON;       /**< Offset: 0xA0 (R/W  32) REFERENCE OSCILLATOR 1 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO1CONCLR;    /**< Offset: 0xA4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1CONSET;    /**< Offset: 0xA8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1CONINV;    /**< Offset: 0xAC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1TRIM;      /**< Offset: 0xB0 (R/W  32) REFERENCE OSCILLATOR 1 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO1TRIMCLR;   /**< Offset: 0xB4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1TRIMSET;   /**< Offset: 0xB8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1TRIMINV;   /**< Offset: 0xBC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2CON;       /**< Offset: 0xC0 (R/W  32) REFERENCE OSCILLATOR 2 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO2CONCLR;    /**< Offset: 0xC4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2CONSET;    /**< Offset: 0xC8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2CONINV;    /**< Offset: 0xCC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2TRIM;      /**< Offset: 0xD0 (R/W  32) REFERENCE OSCILLATOR 2 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO2TRIMCLR;   /**< Offset: 0xD4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2TRIMSET;   /**< Offset: 0xD8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2TRIMINV;   /**< Offset: 0xDC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3CON;       /**< Offset: 0xE0 (R/W  32) REFERENCE OSCILLATOR 3 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO3CONCLR;    /**< Offset: 0xE4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3CONSET;    /**< Offset: 0xE8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3CONINV;    /**< Offset: 0xEC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3TRIM;      /**< Offset: 0xF0 (R/W  32) REFERENCE OSCILLATOR 3 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO3TRIMCLR;   /**< Offset: 0xF4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3TRIMSET;   /**< Offset: 0xF8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3TRIMINV;   /**< Offset: 0xFC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4CON;       /**< Offset: 0x100 (R/W  32) REFERENCE OSCILLATOR 4 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO4CONCLR;    /**< Offset: 0x104 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4CONSET;    /**< Offset: 0x108 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4CONINV;    /**< Offset: 0x10C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4TRIM;      /**< Offset: 0x110 (R/W  32) REFERENCE OSCILLATOR 4 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO4TRIMCLR;   /**< Offset: 0x114 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4TRIMSET;   /**< Offset: 0x118 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4TRIMINV;   /**< Offset: 0x11C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5CON;       /**< Offset: 0x120 (R/W  32) REFERENCE OSCILLATOR 5 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO5CONCLR;    /**< Offset: 0x124 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5CONSET;    /**< Offset: 0x128 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5CONINV;    /**< Offset: 0x12C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5TRIM;      /**< Offset: 0x130 (R/W  32) REFERENCE OSCILLATOR 5 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO5TRIMCLR;   /**< Offset: 0x134 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5TRIMSET;   /**< Offset: 0x138 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5TRIMINV;   /**< Offset: 0x13C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6CON;       /**< Offset: 0x140 (R/W  32) REFERENCE OSCILLATOR 6 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO6CONCLR;    /**< Offset: 0x144 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6CONSET;    /**< Offset: 0x148 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6CONINV;    /**< Offset: 0x14C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6TRIM;      /**< Offset: 0x150 (R/W  32) REFERENCE OSCILLATOR 6 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO6TRIMCLR;   /**< Offset: 0x154 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6TRIMSET;   /**< Offset: 0x158 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6TRIMINV;   /**< Offset: 0x15C (R/W  32)  */
  __IO  uint32_t                       CRU_PB1DIV;         /**< Offset: 0x160 (R/W  32) PB1 CLOCK DIVISOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_PB1DIVCLR;      /**< Offset: 0x164 (R/W  32)  */
  __IO  uint32_t                       CRU_PB1DIVSET;      /**< Offset: 0x168 (R/W  32)  */
  __IO  uint32_t                       CRU_PB1DIVINV;      /**< Offset: 0x16C (R/W  32)  */
  __IO  uint32_t                       CRU_PB2DIV;         /**< Offset: 0x170 (R/W  32) PB2 CLOCK DIVISOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_PB2DIVCLR;      /**< Offset: 0x174 (R/W  32)  */
  __IO  uint32_t                       CRU_PB2DIVSET;      /**< Offset: 0x178 (R/W  32)  */
  __IO  uint32_t                       CRU_PB2DIVINV;      /**< Offset: 0x17C (R/W  32)  */
  __IO  uint32_t                       CRU_PB3DIV;         /**< Offset: 0x180 (R/W  32) PB3 CLOCK DIVISOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_PB3DIVCLR;      /**< Offset: 0x184 (R/W  32)  */
  __IO  uint32_t                       CRU_PB3DIVSET;      /**< Offset: 0x188 (R/W  32)  */
  __IO  uint32_t                       CRU_PB3DIVINV;      /**< Offset: 0x18C (R/W  32)  */
  __IO  uint32_t                       CRU_PB4DIV;         /**< Offset: 0x190 (R/W  32) PB4 CLOCK DIVISOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_PB4DIVCLR;      /**< Offset: 0x194 (R/W  32)  */
  __IO  uint32_t                       CRU_PB4DIVSET;      /**< Offset: 0x198 (R/W  32)  */
  __IO  uint32_t                       CRU_PB4DIVINV;      /**< Offset: 0x19C (R/W  32)  */
  __IO  uint32_t                       CRU_PB5DIV;         /**< Offset: 0x1A0 (R/W  32) PB5 CLOCK DIVISOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_PB5DIVCLR;      /**< Offset: 0x1A4 (R/W  32)  */
  __IO  uint32_t                       CRU_PB5DIVSET;      /**< Offset: 0x1A8 (R/W  32)  */
  __IO  uint32_t                       CRU_PB5DIVINV;      /**< Offset: 0x1AC (R/W  32)  */
  __IO  uint32_t                       CRU_SLEWCON;        /**< Offset: 0x1B0 (R/W  32) SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER */
  __IO  uint32_t                       CRU_SLEWCONCLR;     /**< Offset: 0x1B4 (R/W  32)  */
  __IO  uint32_t                       CRU_SLEWCONSET;     /**< Offset: 0x1B8 (R/W  32)  */
  __IO  uint32_t                       CRU_SLEWCONINV;     /**< Offset: 0x1BC (R/W  32)  */
  __IO  uint32_t                       CRU_CLKSTAT;        /**< Offset: 0x1C0 (R/W  32) CLOCK STATUS REGISTER */
  __IO  uint32_t                       CRU_CLKSTATCLR;     /**< Offset: 0x1C4 (R/W  32)  */
  __IO  uint32_t                       CRU_CLKSTATSET;     /**< Offset: 0x1C8 (R/W  32)  */
  __IO  uint32_t                       CRU_CLKSTATINV;     /**< Offset: 0x1CC (R/W  32)  */
  __I   uint8_t                        Reserved2[0x10];
  __IO  uint32_t                       CRU_CLKDIAG;        /**< Offset: 0x1E0 (R/W  32) USER CLK DIAGNOSTICS CONTROL REGISTER */
  __IO  uint32_t                       CRU_CLKDIAGCLR;     /**< Offset: 0x1E4 (R/W  32)  */
  __IO  uint32_t                       CRU_CLKDIAGSET;     /**< Offset: 0x1E8 (R/W  32)  */
  __IO  uint32_t                       CRU_CLKDIAGINV;     /**< Offset: 0x1EC (R/W  32)  */
} cru_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_CRU_COMPONENT_H_ */
